Revit 2024 API
BendingDetailAngularDimensionsMeasurementOptions Enumeration
 Describes the angular dimension measurement options.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailAngularDimensionsMeasurementOptions
Visual Basic
Public Enumeration BendingDetailAngularDimensionsMeasurementOptions
Visual C++
public enum class BendingDetailAngularDimensionsMeasurementOptions
Members
Member name | Description
Inside |  Measure the angle inside the segments.
Outside |  Measure the angle outside of the segments.
See Also
Autodesk.Revit.DB.Structure Namespace